# ExternalFileUtils Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalFileUtils Class
Members See Also
---
A utility class containing functions related to external file references.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public static class ExternalFileUtils
```

Visual Basic
---
```text
Public NotInheritable Class ExternalFileUtils
```

Visual C++
---
```text
public ref class ExternalFileUtils abstract sealed
```

# Remarks
Elements which are external file references refer to files outside of the base .rvt file. Examples include Revit links, CAD links, the element which stores the location of the keynote file, and rendering decals.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ExternalFileUtils
# See Also
ExternalFileUtils Members
Autodesk.Revit.DB Namespace